/// 체질 × 음식 속성 가중치 테이블
/// + 값 = 도움
/// - 값 = 부담

const Map<String, Map<String, Map<String, int>>> bodyFoodWeight = {
  '토': {
    'ingredients': {
      '쌀': 6,
      '뿌리채소': 6,
      '콩': 4,
      '밀가루': -8,
      '기름짐': -6,
    },
    'cooking': {
      '국물': 4,
      '찜': 5,
      '튀김': -8,
      '볶음': -4,
    },
    'stimulus': {
      '매움': -5,
      '차가움': -6,
      '단짠': -4,
    },
  },

  '목': {
    'ingredients': {
      '채소': 6,
      '해산물': 4,
      '기름짐': -6,
    },
    'cooking': {
      '생식': 6,
      '볶음': -6,
      '튀김': -7,
    },
    'stimulus': {
      '매움': -4,
      '단짠': -5,
    },
  },

  '화': {
    'ingredients': {
      '수분': 6,
      '과일': 5,
      '기름짐': -7,
    },
    'cooking': {
      '생식': 5,
      '국물': -3,
      '튀김': -6,
    },
    'stimulus': {
      '매움': -8,
      '술': -9,
      '단짠': -5,
    },
  },

  '수': {
    'ingredients': {
      '해산물': 6,
      '검은콩': 5,
      '차가움': -7,
    },
    'cooking': {
      '국물': 5,
      '생식': -5,
    },
    'stimulus': {
      '차가움': -8,
      '염분': -5,
    },
  },

  '금': {
    'ingredients': {
      '흰채소': 5,
      '무': 6,
      '기름짐': -6,
    },
    'cooking': {
      '찜': 5,
      '튀김': -8,
    },
    'stimulus': {
      '자극': -6,
      '차가움': -4,
    },
  },
};
